app/controllers/api/challenges_controller.rb

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    friendship = Friendship.find( params[:id] )

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "challenges" ("prompt", "word_count", "friendship_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["prompt", "\n            festivity\n        "], ["word_count", 25], ["friendship_id", 1], ["created_at", "2015-10-13 02:37:11.952303"], ["updated_at", "2015-10-13 02:37:11.952303"]]
UPDATE "challenges" SET "status" = $1, "sender" = $2, "updated_at" = $3 WHERE "challenges"."id" = $4  [["status", "Open"], ["sender", "omily"], ["updated_at", "2015-10-13 02:37:11.956400"], ["id", 1]]
---
  def create
    friendship = Friendship.find( params[:id] )
    challenge = friendship.challenges.create(challenge_params)
    challenge.update({
      status: 'Open',
      sender: current_user.username,
      sender_id: current_user.id
      });