app/controllers/api/friendships_controller.rb

SELECT  1 AS one FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT 1  [["user_id", 2], ["friend_id", 1]]
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["friend_id", 1], ["user_id", 2], ["created_at", "2015-10-13 02:37:06.506440"], ["updated_at", "2015-10-13 02:37:06.506440"]]
---
    def create

      already_friends = current_user.friendships.exists?(:friend_id => params[:friend_id]);

      if !already_friends  && (params[:friend_id].to_i != current_user.id)
        @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
        if @friendship.save