app/controllers/api/posts_controller.rb

  def index
    # current_api_user!
    # aRposts = @current_user.posts
    aRposts = Post.order(created_at: :desc)
    posts = aRposts.map do |aRpost|
---
SELECT "posts".* FROM "posts"

  def genre
  active_record_posts = Post.where({genre: params[:genre]})
---
SELECT "posts".* FROM "posts" WHERE "posts"."genre" = $1  [["genre", "Fiction"]]

  def create
    # current_api_user!
    post = current_user.posts.create(post_params)
---
INSERT INTO "posts" ("message", "prompt", "prompt_type", "word_count", "model_url", "genre", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy

    current_api_user!
    @deleted_post = Post.find(params[:id])

    if (@deleted_post.user_id = current_user.id)
    @deleted_post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 7]]