app/controllers/api/writing_prompts_controller.rb

  def index
    prompts = WritingPrompt.all
    randomId = Random.rand( prompts.length )
    prompt = WritingPrompt.find( randomId )
---
SELECT "writing_prompts".* FROM "writing_prompts"
SELECT  "writing_prompts".* FROM "writing_prompts" WHERE "writing_prompts"."id" = $1 LIMIT 1  [["id", 9820]]

  def one_word
    prompts = WritingPrompt.where({prompt_type: "One Word"})
---
SELECT "writing_prompts".* FROM "writing_prompts" WHERE "writing_prompts"."prompt_type" = $1  [["prompt_type", "One Word"]]