app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "image_url", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create

    @user = User.new(user_params)

    if @user.image_url == ""
      @user.image_url = "http://i.imgur.com/yvuo0U2.png"
    end

    @user.update({writer_score: 0, reviewer_score: 0});

    if @user.save

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def friends
    page = params[:page].to_i + 1


    friendships = current_user.friendships.paginate :page => page
    friends = friendships.map do |friendship|
      friend = User.find( friendship.friend_id )

SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."user_id" WHERE "friendships"."friend_id" = $1  [["friend_id", 1]]
---
  def followers

    page = params[:page].to_i + 1


    inverse_friends = current_user.inverse_friends.paginate :page => page

    followers = inverse_friends.map do |follower|
      data = follower.as_json

      friends = current_user.friend_ids

       if friends.include? follower.id
         data['is_friend'] = true
       else
         data['is_friend'] = false
       end

      data['friend_name'] = follower.username
      data['friend_image'] = follower.image_url
      data['posts'] = follower.posts.length

SELECT "users".* FROM "users"
---
  def add_friends

    page = params[:page].to_i + 1

    new_friends = current_user.potential_friends.paginate :page => page

    add_friends = new_friends.map do |user|

        data = user.as_json
        data['is_friend'] = false
        data['friend_name'] = user.username
        data['friend_image'] = user.image_url
        data['posts'] = user.posts.length